-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 10, 2026 at 09:37 AM
-- Server version: 10.11.13-MariaDB
-- PHP Version: 8.4.12

SET
SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET
time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `LampshadeTest`
--
CREATE
DATABASE IF NOT EXISTS `LampshadeTest` DEFAULT CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci;
USE
`LampshadeTest`;

-- --------------------------------------------------------

--
-- Table structure for table `AccountPermissions`
--

CREATE TABLE `AccountPermissions`
(
    `Id`        bigint(20) NOT NULL,
    `Code`      int(11) NOT NULL,
    `AccountId` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `Accounts`
--

CREATE TABLE `Accounts`
(
    `Id`           bigint(20) NOT NULL,
    `Fullname`     varchar(100) NOT NULL,
    `Username`     varchar(100) NOT NULL,
    `Password`     varchar(100) NOT NULL,
    `Mobile`       varchar(20)  NOT NULL,
    `RoleId`       bigint(20) NOT NULL,
    `ProfilePhoto` varchar(1000) DEFAULT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Accounts`
--

INSERT INTO `Accounts` (`Id`, `Fullname`, `Username`, `Password`, `Mobile`, `RoleId`, `ProfilePhoto`, `CreationDate`,
                        `IsDeleted`)
VALUES (3, 'امیر حسین کریمی', 'Admin', '10000.BvG6ovIk46OvUw/A3OgD/g==.AfdXpTtAdSZEAFlt+X2nT5VWgavXFbC+dP6VGgU1+vE=',
        '09379384214', 1, 'ProfilePhoto/Admin//2026-03-14-01-04-19-profile photo.png', '2026-03-13 12:41:19.852071', 0);

-- --------------------------------------------------------

--
-- Table structure for table `ArticleCategories`
--

CREATE TABLE `ArticleCategories`
(
    `Id`               bigint(20) NOT NULL,
    `Name`             varchar(500)  NOT NULL,
    `Picture`          varchar(500)  NOT NULL,
    `PictureAlt`       varchar(500)  NOT NULL,
    `PictureTitle`     varchar(500)  NOT NULL,
    `Description`      varchar(2000) NOT NULL,
    `ShowOrder`        int(11) NOT NULL,
    `Slug`             varchar(600)  NOT NULL,
    `Keywords`         varchar(100)  NOT NULL,
    `MetaDescription`  varchar(150)  NOT NULL,
    `CanonicalAddress` varchar(1000) NOT NULL,
    `CreationDate`     datetime(6) NOT NULL,
    `IsDeleted`        tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `ArticleCategories`
--

INSERT INTO `ArticleCategories` (`Id`, `Name`, `Picture`, `PictureAlt`, `PictureTitle`, `Description`, `ShowOrder`,
                                 `Slug`, `Keywords`, `MetaDescription`, `CanonicalAddress`, `CreationDate`, `IsDeleted`)
VALUES (3, 'رویداد ها', 'رویدادها//2026-08-09-23-48-43-images.jpeg', 'رویدادها', 'رویدادها',
        'رویدادهای مجموعه را بخوانید', 1, 'رویدادها', 'خبر , رویدادها , رویداد', 'رویدادهای مجموعه را بخوانید', '45',
        '2026-03-11 14:26:04.806722', 0),
       (4, 'محصولات جدید', 'محصولات-جدید//2026-08-09-23-52-51-images2.jpg', 'محصولات جدید', 'محصولات جدید',
        'محصولات جدید اضافه شده به فروشگاه رو با هم بررسی میکنیم', 2, 'محصولات-جدید', 'جدید ، محصولات',
        'محصولات جدید اضافه شده به فروشگاه رو با هم بررسی میکنیم', '35', '2026-08-09 23:52:51.668761', 0),
       (5, 'مقالات علمی', 'مقالات-علمی//2026-08-09-23-55-05-images (1).jpeg', 'مقالات علمی', 'مقالات علمی',
        'مقالات علمی مربوط به محصولات رو مطالعه کنید', 3, 'مقالات-علمی', 'علمی ، مقالات ، مقالات علمی',
        'مقالات علمی مربوط به محصولات رو مطالعه کنید', '25', '2026-08-09 23:55:05.507736', 0);

-- --------------------------------------------------------

--
-- Table structure for table `Articles`
--

CREATE TABLE `Articles`
(
    `Id`               bigint(20) NOT NULL,
    `Title`            varchar(500)  NOT NULL,
    `ShortDescription` varchar(1000) NOT NULL,
    `Description`      longtext      NOT NULL,
    `Picture`          varchar(500)  NOT NULL,
    `PictureAlt`       varchar(500)  NOT NULL,
    `PictureTitle`     varchar(500)  NOT NULL,
    `PublishDate`      datetime(6) NOT NULL,
    `Slug`             varchar(600)  NOT NULL,
    `Keywords`         varchar(100)  NOT NULL,
    `MetaDescription`  varchar(150)  NOT NULL,
    `CanonicalAddress` varchar(1000) NOT NULL,
    `CategoryId`       bigint(20) NOT NULL,
    `CreationDate`     datetime(6) NOT NULL,
    `IsDeleted`        tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Articles`
--

INSERT INTO `Articles` (`Id`, `Title`, `ShortDescription`, `Description`, `Picture`, `PictureAlt`, `PictureTitle`,
                        `PublishDate`, `Slug`, `Keywords`, `MetaDescription`, `CanonicalAddress`, `CategoryId`,
                        `CreationDate`, `IsDeleted`)
VALUES (1, 'ویژگی های مموری فوم',
        'مموری فوم، نوعی از فوم سرد پلی اورتان با دانسیته بالاتراست.\r\nمموری فوم که با نام فوم پلی یورتان ویسکوالاستیک” (Viscoelastic foam) یا فوم پلی یورتان با مقاومت کم (Low resistant polyurethane- LRPu) نیز شناخته شده است به دلیل خواص منحصر به فرد و توانایی انطباق با شکل بدن افراد، اهمیت بالایی پیدا کرده است.\r\nمموری فوم‌ها پس از برداشتن فشار، برای مدت کوتاهی شکل خود را حفظ می‌کنند. به این خاصیت «حافظه» یا همان مموری گفته می‌شود.\r\nمموری فوم با اضافه کردن ترکیبات و مواد افزودنی مختلف به دو جز اصلی پلی یورتا',
        '<p>به روز ترین اخبار موجود در جهانبه روز ترین اخبار موجود در جهانبه روز ترین اخبار موجود در جهان</p>',
        'اخبار/ویژگی های مموری فوم//2026-03-17-23-35-00-cd851d23-6256-3e65-9ba7-05b9e0909ef7.jpg', 'مموری فوم',
        'مموری فوم', '2026-03-03 00:00:00.000000', 'ویژگی های مموری فوم', 'مموری فوم,راحتی,پاف',
        'به روز ترین اخبار موجود در جهان', '1', 5, '2026-03-11 14:26:47.994544', 0),
       (2, 'معرفی جدیدترین محصولات مبلمان و دکوراسیون منزل',
        'در این رویداد، مجموعه‌ای از جدیدترین محصولات فروشگاه شامل انواع مبل، پاف، میز و نگهدارنده معرفی می‌شود.',
        '<h3>هدف از این مجموعه، ارائه محصولاتی با طراحی <strong>مدرن، کاربردی و مناسب</strong> برای فضاهای مختلف منزل است.</h3><p><br></p><p class=\"ql-direction-rtl ql-align-right\">در طراحی محصولات جدید تلاش شده است علاوه بر ظاهر زیبا، راحتی و کاربرد نیز مورد توجه قرار گیرد. استفاده از رنگ‌های متنوع و طراحی‌های ساده باعث شده این محصولات به‌راحتی با سبک‌های مختلف دکوراسیون هماهنگ شوند.</p>',
        'رویدادها/معرفی-جدیدترین-محصولات-مبلمان-و-دکوراسیون-منزل//2026-08-10-12-17-18-imagفقغقفغes.jpg',
        'جدیدترین محصولات مبلمان و دکوراسیون منزل', 'جدیدترین محصولات مبلمان و دکوراسیون منزل',
        '2026-08-09 00:00:00.000000', 'معرفی-جدیدترین-محصولات-مبلمان-و-دکوراسیون-منزل', 'مبلمان ، دکوراسیون ، جدید',
        'در این رویداد، مجموعه‌ای از جدیدترین محصولات فروشگاه شامل انواع مبل، پاف، میز و نگهدارنده معرفی می‌شود.', '30',
        3, '2026-08-10 12:02:07.804628', 0),
       (3, 'نگاهی به دکوراسیون مدرن و نقش مبلمان در آن',
        'در این رویداد، مجموعه‌ای از جدیدترین محصولات فروشگاه شامل انواع مبل، پاف، میز و نگهدارنده معرفی می‌شود.',
        '<h3 class=\"ql-direction-rtl ql-align-right\">در این رویداد، نمونه‌هایی از مبلمان، میزها، پاف‌ها و تجهیزات کاربردی برای ایجاد یک فضای مدرن معرفی شده‌اند. ترکیب رنگ‌های ساده، خطوط نرم و استفاده مناسب از فضای موجود از نکات مهم این سبک به شمار می‌رود.</h3>',
        'رویدادها/نگاهی-به-دکوراسیون-مدرن-و-نقش-مبلمان-در-آن//2026-08-10-12-18-42-farakhan-thumbnail.jpg',
        'نگاهی به دکوراسیون مدرن و نقش مبلمان در آن', 'نگاهی به دکوراسیون مدرن و نقش مبلمان در آن',
        '2026-08-08 00:00:00.000000', 'نگاهی-به-دکوراسیون-مدرن-و-نقش-مبلمان-در-آن', 'مبلمان ، دکوراسیون ، رویداد',
        'dfsdfdsf', '45', 3, '2026-08-10 12:18:42.786456', 0),
       (4, 'انتخاب مبلمان مناسب برای خانه‌های کوچک',
        'با کوچک‌تر شدن بسیاری از فضاهای مسکونی، انتخاب مبلمان مناسب اهمیت بیشتری پیدا کرده است. محصولات چندمنظوره و کم‌جا می‌توانند به استفاده بهتر از فضای موجود کمک کنند.',
        '<h3 class=\"ql-direction-rtl ql-align-right\">در این رویداد، محصولاتی مانند پاف‌های چندکاره، میزهای کوچک و نگهدارنده‌های کاربردی معرفی می‌شوند که علاوه بر زیبایی، فضای زیادی اشغال نمی‌کنند و می‌توانند برای خانه‌های آپارتمانی گزینه مناسبی باشند.</h3>',
        'رویدادها/انتخاب-مبلمان-مناسب-برای-خانه‌های-کوچک//2026-08-10-12-20-04-images (1).jpg',
        'نگاهی به دکوراسیون مدرن و نقش مبلمان در آن', 'نگاهی به دکوراسیون مدرن و نقش مبلمان در آن',
        '2026-08-04 00:00:00.000000', 'انتخاب-مبلمان-مناسب-برای-خانه‌های-کوچک', 'مبلمان ، دکوراسیون ، رویداد',
        'ddfsfdsf', '34', 3, '2026-08-10 12:20:04.871896', 0),
       (5, 'تأثیر طراحی مبلمان بر راحتی کاربران',
        'طراحی مبلمان تنها به ظاهر محصول محدود نمی‌شود و عواملی مانند ابعاد، ارتفاع، شکل و مواد مورد استفاده نیز در میزان راحتی آن تأثیرگذار هستند.',
        '<h3>در طراحی یک محصول مناسب باید تناسب میان ابعاد مبلمان و ویژگی‌های فیزیکی کاربران مورد توجه قرار گیرد. همچنین استفاده از مواد مناسب در بخش‌هایی مانند نشیمن و تکیه‌گاه می‌تواند تجربه استفاده از محصول را بهبود دهد.</h3><h3 class=\"ql-direction-rtl ql-align-right\"><em>در نهایت، ترکیب طراحی مناسب و توجه به نیازهای کاربر می‌تواند محصولی ایجاد کند که علاوه بر ظاهر مناسب، استفاده راحت‌تری نیز داشته باشد.</em></h3>',
        'مقالات-علمی/تأثیر طراحی مبلمان بر راحتی کاربران//2026-08-10-12-22-01-WisdomvsKnowledge_1000x700_jpg_OHVUvmTo-768x538.jpg',
        'تأثیر طراحی مبلمان بر راحتی کاربران', 'تأثیر طراحی مبلمان بر راحتی کاربران', '2026-08-02 00:00:00.000000',
        'تأثیر طراحی مبلمان بر راحتی کاربران', 'مبلمان ، دکوراسیون ، رویداد', 'fdfgdfgdfg', '55', 5,
        '2026-08-10 12:22:01.620105', 0),
       (6, 'پاف جدید',
        'محصول جدید مجموعه، یک پاف با طراحی ساده و مدرن است که می‌تواند در اتاق نشیمن، اتاق خواب یا سایر فضاهای منزل مورد استفاده قرار گیرد.',
        '<h3 class=\"ql-direction-rtl ql-align-right\">ابعاد مناسب و طراحی جمع‌وجور این محصول باعث شده بتوان آن را در کنار مبل یا میز قرار داد. این پاف علاوه بر کاربرد اصلی خود می‌تواند به عنوان یک عنصر دکوراتیو نیز در فضای داخلی استفاده شود.</h3>',
        'محصولات-جدید/پاف-جدید//2026-08-10-12-23-51-1785843075755.jpeg', 'پاف جدید', 'پاف جدید',
        '2026-08-06 00:00:00.000000', 'پاف-جدید', 'پاف ، جدید', 'بلیبل یببیلیبل', '67', 4, '2026-08-10 12:23:51.103098',
        0),
       (7, 'میز جدید',
        'یکی از محصولات جدید فروشگاه، میز با طراحی مینیمال و ساده است. طراحی این محصول به گونه‌ای انجام شده که بتواند با سبک‌های مختلف دکوراسیون هماهنگ شود.',
        '<h3>یکی از محصولات جدید فروشگاه، میز با طراحی مینیمال و ساده است. طراحی این محصول به گونه‌ای انجام شده که بتواند با سبک‌های مختلف دکوراسیون هماهنگ شود.</h3><h3 class=\"ql-direction-rtl ql-align-right\">استفاده از خطوط ساده و ابعاد مناسب باعث شده این میز گزینه‌ای کاربردی برای فضاهای مختلف باشد. می‌توان از آن در کنار مبلمان یا به عنوان یک میز مستقل استفاده کرد.</h3>',
        'محصولات-جدید/میز-جدید//2026-08-10-12-26-28-1666283991.jpg', 'میز جدید', 'میز جدید',
        '2026-08-09 00:00:00.000000', 'میز-جدید', 'میز ، حدید', 'لببیلیبل', '71', 4, '2026-08-10 12:26:28.537337', 0);

-- --------------------------------------------------------

--
-- Table structure for table `CartItems`
--

CREATE TABLE `CartItems`
(
    `Id`           bigint(20) NOT NULL,
    `ProductId`    bigint(20) NOT NULL,
    `Name`         longtext     NOT NULL,
    `UnitPrice` double NOT NULL,
    `Picture`      longtext     NOT NULL,
    `Count`        int(11) NOT NULL,
    `TotalItemPrice` double NOT NULL,
    `IsInStock`    tinyint(1) NOT NULL,
    `DiscountRate` int(11) NOT NULL,
    `DiscountAmount` double NOT NULL,
    `ItemPayAmount` double NOT NULL,
    `CartId`       bigint(20) NOT NULL,
    `ProductSlug`  varchar(200) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `CartItems`
--

INSERT INTO `CartItems` (`Id`, `ProductId`, `Name`, `UnitPrice`, `Picture`, `Count`, `TotalItemPrice`, `IsInStock`,
                         `DiscountRate`, `DiscountAmount`, `ItemPayAmount`, `CartId`, `ProductSlug`)
VALUES (182, 13, 'صندلی چهارپایه مدل ۲۲۱', 950000, 'صندلی-چهارپایه-مدل//2026-02-27-00-22-23-Product09.jpg', 1, 950000,
        1, 0, 0, 950000, 47, 'صندلی-چهارپایه-مدل-221'),
       (183, 14, 'صندلی چهارپایه مدل ۳۳۲', 1935000, 'صندلی-چهارپایه-مدل//2026-02-27-00-23-19-Product10.jpg', 3, 5805000,
        1, 0, 0, 5805000, 48, 'صندلی-چهارپایه-مدل-332'),
       (184, 9, 'پاف مدل ۱۲۱', 750000, 'پاف-مدل۱۲۱//2026-02-27-00-15-06-product01.jpg', 1, 750000, 1, 0, 0, 750000, 48,
        'پاف-مدل۱۲۱'),
       (185, 12, 'نگهدارنده فلزی مدل ۱۴۲', 2300000, 'نگهدارنده-چوبی-مدل//2026-02-27-00-20-10-Product05.jpg', 1, 2300000,
        1, 0, 0, 2300000, 49, 'نگهدارنده-چوبی-مدل-142'),
       (186, 13, 'صندلی چهارپایه مدل ۲۲۱', 950000, 'صندلی-چهارپایه-مدل//2026-02-27-00-22-23-Product09.jpg', 1, 950000,
        1, 0, 0, 950000, 50, 'صندلی-چهارپایه-مدل-221'),
       (187, 12, 'نگهدارنده فلزی مدل ۱۴۲', 2300000, 'نگهدارنده-چوبی-مدل//2026-02-27-00-20-10-Product05.jpg', 1, 2300000,
        1, 0, 0, 2300000, 51, 'نگهدارنده-چوبی-مدل-142'),
       (188, 12, 'نگهدارنده فلزی مدل ۱۴۲', 2300000, 'نگهدارنده-چوبی-مدل//2026-02-27-00-20-10-Product05.jpg', 3, 6900000,
        1, 0, 0, 6900000, 52, 'نگهدارنده-چوبی-مدل-142'),
       (189, 10, 'پاف مدل ۱۳۱', 600000, 'پاف-مدل//2026-02-27-00-16-21-product02.jpg', 2, 600000, 1, 0, 0, 600000, 53,
        'پاف-مدل'),
       (190, 12, 'نگهدارنده فلزی مدل ۱۴۲', 2300000, 'نگهدارنده-چوبی-مدل//2026-02-27-00-20-10-Product05.jpg', 1, 2300000,
        1, 0, 0, 2300000, 54, 'نگهدارنده-چوبی-مدل-142'),
       (191, 14, 'صندلی چهارپایه مدل ۳۳۲', 1935000, 'صندلی-چهارپایه-مدل//2026-02-27-00-23-19-Product10.jpg', 5, 1935000,
        1, 0, 0, 1935000, 55, 'صندلی-چهارپایه-مدل-332'),
       (192, 13, 'صندلی چهارپایه مدل ۲۲۱', 950000, 'صندلی-چهارپایه-مدل//2026-02-27-00-22-23-Product09.jpg', 3, 2850000,
        1, 0, 0, 2850000, 56, 'صندلی-چهارپایه-مدل-221'),
       (193, 11, 'پاف مدل ۱۴۲', 855000, 'پاف-مدل//2026-02-27-00-17-01-product04.jpg', 1, 855000, 1, 0, 0, 855000, 57,
        'پاف-مدل۱۴۲'),
       (194, 11, 'پاف مدل ۱۴۲', 855000, 'پاف-مدل//2026-02-27-00-17-01-product04.jpg', 2, 1710000, 1, 0, 0, 1710000, 58,
        'پاف-مدل۱۴۲'),
       (196, 14, 'صندلی چهارپایه مدل ۳۳۲', 5000000, 'صندلی-چهارپایه-مدل//2026-02-27-00-23-19-Product10.jpg', 2,
        10000000, 1, 9, 900000, 9100000, 59, 'صندلی-چهارپایه-مدل-332'),
       (197, 22, 'پاف مدل مربع', 1700000, 'پاف-مدل-مربع//2026-08-09-21-29-29-1785843057223.jpeg', 3, 5100000, 1, 0, 0,
        5100000, 59, 'پاف-مدل-مربع'),
       (198, 25, 'پاف مدل SW4', 2150000, 'پاف-مدل-sw4//2026-08-09-21-34-03-1785843044133.jpeg', 2, 2150000, 1, 0, 0,
        2150000, 59, 'پاف-مدل-sw4');

-- --------------------------------------------------------

--
-- Table structure for table `Carts`
--

CREATE TABLE `Carts`
(
    `Id`            bigint(20) NOT NULL,
    `AccountId`     bigint(20) NOT NULL,
    `TotalAmount` double NOT NULL,
    `DiscountAmount` double NOT NULL,
    `PayAmount` double NOT NULL,
    `CreationDate`  datetime(6) NOT NULL,
    `IsDeleted`     tinyint(1) NOT NULL,
    `PaymentMethod` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Carts`
--

INSERT INTO `Carts` (`Id`, `AccountId`, `TotalAmount`, `DiscountAmount`, `PayAmount`, `CreationDate`, `IsDeleted`,
                     `PaymentMethod`)
VALUES (47, 5, 950000, 0, 950000, '2026-03-18 20:55:45.424805', 1, 1),
       (48, 5, 5805000, 0, 5805000, '2026-03-20 02:38:18.952200', 1, 1),
       (49, 6, 2300000, 0, 2300000, '2026-03-20 02:48:03.356807', 1, 1),
       (50, 4, 950000, 0, 950000, '2026-03-20 02:50:08.715650', 1, 1),
       (51, 5, 2300000, 0, 2300000, '2026-03-20 03:24:10.753745', 1, 1),
       (52, 3, 6900000, 0, 6900000, '2026-08-04 00:46:09.298693', 1, 1),
       (53, 3, 600000, 0, 600000, '2026-08-04 00:49:08.856061', 1, 1),
       (54, 3, 2300000, 0, 2300000, '2026-08-04 00:56:45.419924', 1, 1),
       (55, 3, 1935000, 0, 1935000, '2026-08-04 10:11:26.173582', 1, 1),
       (56, 3, 2850000, 0, 2850000, '2026-08-04 13:57:43.691286', 1, 1),
       (57, 3, 855000, 0, 855000, '2026-08-04 14:19:37.525054', 1, 1),
       (58, 3, 1710000, 0, 1710000, '2026-08-04 19:05:05.136086', 1, 1),
       (59, 3, 1555000, 108850, 1446150, '2026-08-07 11:55:52.542850', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `ColleagueDiscounts`
--

CREATE TABLE `ColleagueDiscounts`
(
    `Id`           bigint(20) NOT NULL,
    `ProductId`    bigint(20) NOT NULL,
    `DiscountRate` int(11) NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `ColleagueDiscounts`
--

INSERT INTO `ColleagueDiscounts` (`Id`, `ProductId`, `DiscountRate`, `CreationDate`, `IsDeleted`)
VALUES (2, 13, 10, '2026-02-27 00:39:30.329521', 0),
       (3, 8, 45, '2026-02-27 00:39:40.092309', 0),
       (4, 9, 15, '2026-02-27 00:39:47.676501', 0),
       (5, 20, 30, '2026-08-09 23:58:20.927266', 0),
       (6, 14, 10, '2026-08-09 23:58:47.211501', 0),
       (7, 16, 55, '2026-08-09 23:59:26.655403', 0);

-- --------------------------------------------------------

--
-- Table structure for table `Comments`
--

CREATE TABLE `Comments`
(
    `Id`            bigint(20) NOT NULL,
    `Name`          varchar(500)  NOT NULL,
    `Email`         varchar(500)  NOT NULL,
    `Website`       varchar(500) DEFAULT NULL,
    `Message`       varchar(1000) NOT NULL,
    `IsConfirmed`   tinyint(1) NOT NULL,
    `OwnerRecordId` bigint(20) NOT NULL,
    `Type`          int(11) NOT NULL,
    `parentId`      bigint(20) DEFAULT NULL,
    `CreationDate`  datetime(6) NOT NULL,
    `IsDeleted`     tinyint(1) NOT NULL,
    `Rating` double NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Comments`
--

INSERT INTO `Comments` (`Id`, `Name`, `Email`, `Website`, `Message`, `IsConfirmed`, `OwnerRecordId`, `Type`, `parentId`,
                        `CreationDate`, `IsDeleted`, `Rating`)
VALUES (19, 'Admin', 'amirhkz1384@gmail.com', NULL, 'sdfsdfsdf', 1, 8, 1, 0, '2026-03-17 18:23:44.152716', 0, 5),
       (20, 'Admin', 'dfgfdg', NULL, 'dfgdfg', 1, 13, 1, 0, '2026-03-17 18:27:51.329242', 0, 5),
       (21, 'Admin', 'fsdfsdf', NULL, 'sdfsdfsdf', 1, 13, 1, 0, '2026-03-17 20:33:09.942266', 0, 4),
       (22, 'Admin', 'amirhlsdf@sdf.ssdf', NULL, 'jlfgkjdfoigjod', 1, 13, 1, 0, '2026-03-17 20:57:17.611769', 0, 3),
       (23, 'Admin', 'amirhkzs@sdfsdf.sdfsd', NULL, 'sdfhgtrhfg', 1, 13, 1, 0, '2026-03-17 20:57:36.843763', 0, 2),
       (24, 'Admin', 'sdfsdfsd@dsfsd.sdf', NULL, 'sdfgfgdfgdf', 1, 13, 1, 0, '2026-03-17 21:07:41.357352', 0, 4),
       (25, 'Admin', 'amirhkz1384@gamil.com', NULL, 'به شدت نرم و عالی هستش ', 1, 11, 1, 0,
        '2026-03-17 22:43:47.277112', 0, 4),
       (31, 'محمد مولوی', 'amirhkz1384@gmail.com', NULL, 'بسیار عالی بود واقعا شیک هستش', 1, 14, 1, 0,
        '2026-03-20 02:37:08.344779', 0, 4),
       (32, 'زهرا یزدان پناه', 'motaharekarimi1386@gmail.com', NULL,
        'مقاله خوبی بود فقط این مموری فوم داخل کدوم محصولات استفاده شده ؟', 1, 1, 2, 0, '2026-03-20 02:38:04.444027', 0,
        0),
       (35, 'امیر علی فتاحی', 'amirhkz1384@gmail.com', NULL, 'صندلی خوبیه اگه چیز دیگه ای پیدا نکردین', 1, 12, 1, NULL,
        '2026-08-04 13:52:20.280630', 0, 1),
       (36, 'محمد اقبالی', 'amirhkz1384@gmail.com', NULL, 'خوب بود نسبت به قیمتش و راضی کننده بود', 1, 6, 1, NULL,
        '2026-08-04 13:55:21.479797', 0, 1),
       (37, 'رضا بصیری', 'amirhkz1384@gmail.com', NULL, 'چیز جالبی بود ارزش تجربه داشتش ', 1, 10, 1, NULL,
        '2026-08-04 13:56:13.862666', 0, 1),
       (38, 'محمد اقبالی', 'amirhkz1384@gmail.com', NULL, 'خوب نبود و بد بدستم رسید و اون چیزی که گفته شده بود نبود ',
        1, 9, 1, NULL, '2026-08-04 13:57:05.028102', 0, 4),
       (39, 'Admin', 'amirhkz1384@gmail.com', NULL, 'نگهدارنده خوبیه اگه چیز دیگه ای پیدا نکردین', 1, 7, 1, NULL,
        '2026-08-10 00:00:36.570294', 0, 4),
       (40, 'Admin', 'amirfake@erzi.me', NULL, 'بد نیست خوب بود', 1, 21, 1, NULL, '2026-08-10 00:00:57.444494', 0, 1),
       (41, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 22, 1, NULL, '2026-08-10 00:01:27.163206', 0, 1),
       (42, 'Admin', 'amirhkz1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 16, 1, NULL, '2026-08-10 00:01:45.918129', 0, 1),
       (43, 'Admin', 'amirhkz1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 20, 1, NULL, '2026-08-10 00:02:27.177931', 0, 1),
       (44, 'Admin', 'amirhkz1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 25, 1, NULL, '2026-08-10 00:02:43.006374', 0, 1),
       (45, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 12, 1, NULL, '2026-08-10 00:03:01.843274', 0, 4),
       (46, 'Admin', 'amirhkz1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 25, 1, NULL, '2026-08-10 00:03:18.352602', 0, 5),
       (47, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 6, 1, NULL, '2026-08-10 00:03:45.561440', 0, 4),
       (48, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 23, 1, NULL, '2026-08-10 00:03:58.979018', 0, 1),
       (49, 'Admin', 'amirhkz1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 24, 1, NULL, '2026-08-10 00:04:16.199834', 0, 5),
       (50, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 26, 1, NULL, '2026-08-10 00:05:22.954871', 0, 4),
       (51, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 22, 1, NULL, '2026-08-10 00:05:42.105647', 0, 4),
       (52, 'Admin', 'amirhossinkarimizarchi1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 15, 1, NULL, '2026-08-10 00:05:57.446748', 0, 5),
       (53, 'Admin', 'amirhkz1384@gmail.com', NULL,
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        1, 12, 1, NULL, '2026-08-10 00:06:18.336674', 0, 4);

-- --------------------------------------------------------

--
-- Table structure for table `CustomerDiscount`
--

CREATE TABLE `CustomerDiscount`
(
    `Id`           bigint(20) NOT NULL,
    `ProductId`    bigint(20) NOT NULL,
    `DiscountRate` int(11) NOT NULL,
    `StartDate`    datetime(6) NOT NULL,
    `EndDate`      datetime(6) NOT NULL,
    `Reason`       varchar(500) NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `CustomerDiscount`
--

INSERT INTO `CustomerDiscount` (`Id`, `ProductId`, `DiscountRate`, `StartDate`, `EndDate`, `Reason`, `CreationDate`,
                                `IsDeleted`)
VALUES (5, 12, 10, '2026-02-27 00:00:00.000000', '2026-03-20 00:00:00.000000', 'تخفیف انبار تکانی',
        '2026-02-27 00:37:18.502099', 0),
       (6, 9, 12, '2026-02-26 00:00:00.000000', '2026-03-12 00:00:00.000000', 'تخفیف انبار تکانی',
        '2026-02-27 00:37:40.785847', 1),
       (7, 7, 19, '2026-02-24 00:00:00.000000', '2026-03-02 00:00:00.000000', 'تخفیف انبار تکانی',
        '2026-02-27 00:37:58.142613', 1),
       (8, 6, 35, '2026-03-06 00:00:00.000000', '2026-03-16 00:00:00.000000', 'تخفیف انبار تکانی',
        '2026-02-27 00:38:22.346276', 1),
       (9, 13, 5, '2026-02-24 00:00:00.000000', '2026-03-10 00:00:00.000000', 'تخفیف انبار تکانی',
        '2026-02-27 00:39:12.145520', 1),
       (10, 9, 53, '2026-03-19 00:00:00.000000', '2026-03-20 00:00:00.000000', 'fdgdfg', '2026-03-16 00:44:30.859208',
        0),
       (11, 15, 7, '2026-03-18 00:00:00.000000', '2026-09-08 00:00:00.000000', 'sdfsdfsdf',
        '2026-03-16 00:45:34.291917', 0),
       (12, 10, 30, '2026-03-16 00:00:00.000000', '2026-03-20 00:00:00.000000', 'دوست دارم',
        '2026-03-17 00:44:37.903179', 0),
       (13, 21, 12, '2026-08-08 00:00:00.000000', '2026-08-22 00:00:00.000000', 'تخفیف تابستانی ',
        '2026-08-09 23:56:21.200688', 0),
       (14, 24, 5, '2026-08-08 00:00:00.000000', '2026-08-16 00:00:00.000000', 'تخفیف تابستانی ',
        '2026-08-09 23:56:44.731632', 0),
       (15, 14, 9, '2026-08-04 00:00:00.000000', '2026-08-21 00:00:00.000000', 'تخفیف تابستانی ',
        '2026-08-09 23:57:07.159016', 0),
       (16, 26, 22, '2026-08-04 00:00:00.000000', '2026-08-21 00:00:00.000000', 'تخفیف تابستانی ',
        '2026-08-09 23:57:33.116799', 0),
       (17, 7, 18, '2026-08-08 00:00:00.000000', '2026-08-19 00:00:00.000000', 'تخفیف تابستانی ',
        '2026-08-09 23:57:57.966489', 0);

-- --------------------------------------------------------

--
-- Table structure for table `Inventories`
--

CREATE TABLE `Inventories`
(
    `Id`           bigint(20) NOT NULL,
    `ProductId`    bigint(20) NOT NULL,
    `UnitPrice` double NOT NULL,
    `InStock`      tinyint(1) NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Inventories`
--

INSERT INTO `Inventories` (`Id`, `ProductId`, `UnitPrice`, `InStock`, `CreationDate`, `IsDeleted`)
VALUES (5, 6, 1500000, 1, '2026-02-27 00:31:20.964065', 0),
       (14, 15, 1555000, 1, '2026-03-17 13:04:47.327533', 0),
       (15, 16, 5500000, 1, '2026-08-09 21:43:51.444372', 0),
       (16, 26, 4000000, 1, '2026-08-09 21:44:09.037543', 0),
       (17, 21, 3000000, 1, '2026-08-09 21:44:25.152045', 0),
       (18, 14, 5000000, 1, '2026-08-09 21:45:33.449190', 0),
       (19, 17, 6200000, 1, '2026-08-09 21:45:47.515049', 0),
       (20, 18, 4000000, 1, '2026-08-09 21:46:10.290247', 0),
       (21, 7, 2250000, 1, '2026-08-09 21:46:28.462415', 0),
       (22, 20, 1500000, 1, '2026-08-09 21:46:42.988293', 0),
       (23, 22, 1700000, 1, '2026-08-09 21:46:58.358978', 0),
       (24, 25, 2150000, 1, '2026-08-09 21:47:13.253215', 0),
       (25, 12, 2500000, 1, '2026-08-10 00:06:40.918565', 0);

-- --------------------------------------------------------

--
-- Table structure for table `InventoryOperations`
--

CREATE TABLE `InventoryOperations`
(
    `Id`            bigint(20) NOT NULL,
    `Operation`     tinyint(1) NOT NULL,
    `Count`         bigint(20) NOT NULL,
    `OperatorId`    bigint(20) NOT NULL,
    `OperationDate` datetime(6) NOT NULL,
    `CurrentCount`  bigint(20) NOT NULL,
    `Description`   varchar(500) NOT NULL,
    `OrderId`       bigint(20) NOT NULL,
    `InventoryId`   bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `InventoryOperations`
--

INSERT INTO `InventoryOperations` (`Id`, `Operation`, `Count`, `OperatorId`, `OperationDate`, `CurrentCount`,
                                   `Description`, `OrderId`, `InventoryId`)
VALUES (33, 1, 5, 3, '2026-03-15 01:58:55.191764', 5, 'xcvcbcvb', 1, 5),
       (56, 0, 3, 3, '2026-03-17 01:01:21.464793', 2, 'خرید مشتری', 1, 5),
       (85, 1, 30, 3, '2026-03-17 13:04:05.004556', 32, 'شارژ انبار با شماره سفارش 2025', 1, 5),
       (187, 1, 5, 3, '2026-08-07 12:14:22.000253', 5, 'jnkjkh', 1, 14),
       (188, 1, 5, 3, '2026-08-07 19:15:02.559053', 10, 'fgdfgdfg', 1, 14),
       (189, 1, 10, 3, '2026-08-09 21:44:52.376212', 10, 'خرید تکمیل ظرفیت مرداد', 1, 17),
       (190, 1, 20, 3, '2026-08-09 21:45:03.750747', 20, 'خرید تکمیل ظرفیت مرداد', 1, 16),
       (191, 1, 14, 3, '2026-08-09 21:45:13.219309', 14, 'خرید تکمیل ظرفیت مرداد', 1, 15),
       (192, 1, 10, 3, '2026-08-09 21:47:30.683358', 10, 'خرید تکمیل ظرفیت مرداد', 1, 24),
       (193, 1, 25, 3, '2026-08-09 21:47:40.367968', 25, 'خرید تکمیل ظرفیت مرداد', 1, 23),
       (194, 1, 30, 3, '2026-08-09 21:47:48.552950', 30, 'خرید تکمیل ظرفیت مرداد', 1, 22),
       (195, 1, 25, 3, '2026-08-09 21:48:02.621507', 25, 'خرید تکمیل ظرفیت مرداد', 1, 21),
       (196, 1, 12, 3, '2026-08-09 21:48:18.723400', 12, 'خرید تکمیل ظرفیت مرداد', 1, 20),
       (197, 1, 14, 3, '2026-08-09 21:48:26.786151', 14, 'خرید تکمیل ظرفیت مرداد', 1, 19),
       (198, 1, 7, 3, '2026-08-09 21:48:36.535617', 7, 'خرید تکمیل ظرفیت مرداد', 1, 18),
       (199, 1, 15, 3, '2026-08-10 00:07:00.715351', 15, 'خرید تابستان 405', 1, 25),
       (200, 0, 2, 3, '2026-08-10 00:09:24.083778', 5, 'خرید مشتری با شماره پیگیری 100', 1, 18),
       (201, 0, 3, 3, '2026-08-10 00:09:24.106096', 22, 'خرید مشتری با شماره پیگیری 100', 1, 23),
       (202, 0, 2, 3, '2026-08-10 00:09:24.118982', 8, 'خرید مشتری با شماره پیگیری 100', 1, 24),
       (203, 0, 2, 3, '2026-08-10 00:09:30.997268', 3, 'خرید مشتری با شماره پیگیری PJBD342', 1, 18),
       (204, 0, 3, 3, '2026-08-10 00:09:31.016404', 19, 'خرید مشتری با شماره پیگیری PJBD342', 1, 23),
       (205, 0, 2, 3, '2026-08-10 00:09:31.029923', 6, 'خرید مشتری با شماره پیگیری PJBD342', 1, 24);

-- --------------------------------------------------------

--
-- Table structure for table `OrderItems`
--

CREATE TABLE `OrderItems`
(
    `Id`           bigint(20) NOT NULL,
    `ProductId`    bigint(20) NOT NULL,
    `Count`        int(11) NOT NULL,
    `UnitPrice` double NOT NULL,
    `DiscountRate` int(11) NOT NULL,
    `OrderId`      bigint(20) NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `OrderItems`
--

INSERT INTO `OrderItems` (`Id`, `ProductId`, `Count`, `UnitPrice`, `DiscountRate`, `OrderId`, `CreationDate`,
                          `IsDeleted`)
VALUES (108, 14, 2, 5000000, 9, 92, '2026-08-10 00:09:23.997162', 0),
       (109, 22, 3, 1700000, 0, 92, '2026-08-10 00:09:23.997339', 0),
       (110, 25, 2, 2150000, 0, 92, '2026-08-10 00:09:23.997339', 0);

-- --------------------------------------------------------

--
-- Table structure for table `Orders`
--

CREATE TABLE `Orders`
(
    `Id`              bigint(20) NOT NULL,
    `AccountId`       bigint(20) NOT NULL,
    `PaymentMethod`   int(11) NOT NULL,
    `TotalAmount` double NOT NULL,
    `DiscountAmount` double NOT NULL,
    `PayAmount` double NOT NULL,
    `IsPaid`          tinyint(1) NOT NULL,
    `IsCanceled`      tinyint(1) NOT NULL,
    `IssueTrackingNo` varchar(8) NOT NULL,
    `RefId`           bigint(20) NOT NULL,
    `CreationDate`    datetime(6) NOT NULL,
    `IsDeleted`       tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Orders`
--

INSERT INTO `Orders` (`Id`, `AccountId`, `PaymentMethod`, `TotalAmount`, `DiscountAmount`, `PayAmount`, `IsPaid`,
                      `IsCanceled`, `IssueTrackingNo`, `RefId`, `CreationDate`, `IsDeleted`)
VALUES (92, 3, 1, 19400000, 900000, 18500000, 1, 0, 'PJBD342', 409476001, '2026-08-10 00:09:23.996217', 0);

-- --------------------------------------------------------

--
-- Table structure for table `ProductCategories`
--

CREATE TABLE `ProductCategories`
(
    `Id`              bigint(20) NOT NULL,
    `Title`           varchar(50)  NOT NULL,
    `Description`     varchar(255) NOT NULL,
    `Picture`         longtext     NOT NULL,
    `PictureAlt`      varchar(155) NOT NULL,
    `PictureTitle`    varchar(60)  NOT NULL,
    `MetaDescription` varchar(255) NOT NULL,
    `Keywords`        varchar(255) NOT NULL,
    `Slug`            longtext     NOT NULL,
    `CreationDate`    datetime(6) NOT NULL,
    `IsDeleted`       tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `ProductCategories`
--

INSERT INTO `ProductCategories` (`Id`, `Title`, `Description`, `Picture`, `PictureAlt`, `PictureTitle`,
                                 `MetaDescription`, `Keywords`, `Slug`, `CreationDate`, `IsDeleted`)
VALUES (5, 'صندلی', 'صندلی', 'صندلی//2026-02-27-00-02-03-Product12.png', 'صندلی چهارپایه با طراحی مدرن ', 'صندلی',
        'صندلی چهارپایه با طراحی مدرن ', 'صندلی مدرن', 'صندلی', '2026-02-27 00:01:40.869855', 0),
       (6, 'نگهدارنده', 'نگهدارنده با طراحی مدرن در مدلهای مختلف', 'نگهدارنده//2026-02-27-00-04-22-Product06.jpg',
        'نگهدارنده', 'نگهدارنده', 'نگهدارنده با طراحی مدرن در مدلهای مختلف', 'نگهدارنده مدرن', 'نگهدارنده',
        '2026-02-27 00:04:22.034541', 0),
       (7, 'پاف', 'پاف با طراحی مدرن و ساخته شده ای پشم شیشه و پارچه مرغوب', 'پاف//2026-02-27-00-05-50-product03.jpg',
        'پاف', 'پاف', 'پاف با طراحی مدرن و ساخته شده ای پشم شیشه و پارچه مرغوب', 'پاف مدرن مرغوب', 'پاف',
        '2026-02-27 00:05:50.518650', 0),
       (8, 'میز ناهارخوری', 'بهترین میزهای ناهار خوری با طراحی و مد روز و مقاوم و با دوام',
        'میز-ناهارخوری//2026-08-09-23-35-34-images.jpeg',
        'بهترین میزهای ناهار خوری با طراحی و مد روز و مقاوم و با دوام', 'میز ناهارخوری',
        'بهترین میزهای ناهار خوری با طراحی و مد روز و مقاوم و با دوام', 'میز،ناهارخوری', 'میز-ناهارخوری',
        '2026-08-09 23:35:34.515756', 0),
       (9, 'آینه و کنسول', 'بهترین آینه ها و کنسول‌ها با طراحی و مد روز و مقاوم و با دوام',
        'آینه-و-کنسول//2026-08-09-23-39-37-images.jpg', 'بهترین آینه ها و کنسول‌ها با طراحی و مد روز و مقاوم و با دوام',
        'اینه و کنسول', 'بهترین آینه ها و کنسول‌ها با طراحی و مد روز و مقاوم و با دوام', 'آینه و کنسول', 'آینه-و-کنسول',
        '2026-08-09 23:39:37.475961', 0);

-- --------------------------------------------------------

--
-- Table structure for table `ProductPictures`
--

CREATE TABLE `ProductPictures`
(
    `Id`           bigint(20) NOT NULL,
    `ProductId`    bigint(20) NOT NULL,
    `Picture`      varchar(1000) NOT NULL,
    `PictureAlt`   varchar(500)  NOT NULL,
    `PictureTitle` varchar(500)  NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `ProductPictures`
--

INSERT INTO `ProductPictures` (`Id`, `ProductId`, `Picture`, `PictureAlt`, `PictureTitle`, `CreationDate`, `IsDeleted`)
VALUES (6, 6, 'نگهدارنده-چوبی-مدل//2026-02-27-00-10-43-Product07.jpg', 'صندلی از سمت چپ مدل ۱۱۱', 'صندلی مدل ۱۱۱',
        '2026-02-27 00:12:19.688757', 0),
       (7, 25, 'پاف//پاف-مدل-sw4//2026-08-09-21-36-37-1785843044001.jpeg', '۱', '۲', '2026-08-09 21:36:37.137781', 0),
       (8, 24, 'پاف//پاف-مدل-وان//2026-08-09-21-36-54-1785843010450.jpeg', '۱', '۲', '2026-08-09 21:36:54.946110', 0),
       (9, 23, 'پاف//پاف-مدل-حنا//2026-08-09-21-37-12-1785843075713.jpeg', '۱', '۲', '2026-08-09 21:37:12.043277', 0),
       (10, 23, 'پاف//پاف-مدل-حنا//2026-08-09-21-37-25-1785843075695.jpeg', '۱', '۲', '2026-08-09 21:37:25.385850', 0),
       (11, 23, 'پاف//پاف-مدل-حنا//2026-08-09-21-37-39-1785843075753.jpeg', '۱', '۲', '2026-08-09 21:37:39.750242', 0),
       (12, 22, 'پاف//پاف-مدل-مربع//2026-08-09-21-38-00-1785843057397.jpeg', '۱', '۲', '2026-08-09 21:38:00.928716', 0),
       (13, 22, 'پاف//پاف-مدل-مربع//2026-08-09-21-38-17-1785843057290.jpeg', '۱', '۲', '2026-08-09 21:38:17.017146', 0),
       (14, 21, 'پاف//پاف-مدل-هیراد//2026-08-09-21-38-32-1785843095915.jpeg', '۱', '۲', '2026-08-09 21:38:32.332545',
        0),
       (15, 20, 'پاف//پاف-مدلی-مینیفر//2026-08-09-21-38-48-1785843115652.jpeg', '۱', '۲', '2026-08-09 21:38:48.195067',
        0),
       (16, 20, 'پاف//پاف-مدلی-مینیفر//2026-08-09-21-39-01-1785843115755.jpeg', '۱', '۲', '2026-08-09 21:39:01.328995',
        0),
       (17, 20, 'پاف//پاف-مدلی-مینیفر//2026-08-09-21-39-12-1785843115881.jpeg', '۱', '۲', '2026-08-09 21:39:12.671888',
        0),
       (18, 21, 'پاف//پاف-مدل-هیراد//2026-08-09-21-39-37-1785843095961.jpeg', '۱', '۲', '2026-08-09 21:39:37.836896',
        0),
       (19, 16, 'صندلی//صندلی-مدل-تدی//2026-08-09-21-39-59-1785842732739.jpeg', '۱', '۲', '2026-08-09 21:39:59.614597',
        0),
       (20, 16, 'صندلی//صندلی-مدل-تدی//2026-08-09-21-40-13-1785842732711.jpeg', '۱', '۲', '2026-08-09 21:40:13.163957',
        0),
       (21, 17, 'صندلی//صندلی-اوپن-دیارا//2026-08-09-21-40-33-1785842709356.jpeg', '۱', '۲',
        '2026-08-09 21:40:33.580482', 0),
       (22, 17, 'صندلی//صندلی-اوپن-دیارا//2026-08-09-21-40-49-1785842709408.jpeg', '۱', '۲',
        '2026-08-09 21:40:49.208165', 0),
       (23, 17, 'صندلی//صندلی-اوپن-دیارا//2026-08-09-21-41-01-1785842709497.jpeg', '۱', '۲',
        '2026-08-09 21:41:01.638233', 0),
       (24, 17, 'صندلی//صندلی-اوپن-دیارا//2026-08-09-21-41-20-1785842709343.jpeg', '۱', '۲',
        '2026-08-09 21:41:20.747869', 0),
       (25, 19, 'صندلی//صندلی-هلیکا-مدل-لارا//2026-08-09-21-41-49-1785842538821.jpeg', '۱', '۲',
        '2026-08-09 21:41:49.437071', 0),
       (26, 19, 'صندلی//صندلی-هلیکا-مدل-لارا//2026-08-09-21-42-02-1785842537845.jpeg', '۱', '۲',
        '2026-08-09 21:42:02.274775', 0);

-- --------------------------------------------------------

--
-- Table structure for table `Products`
--

CREATE TABLE `Products`
(
    `Id`               bigint(20) NOT NULL,
    `Name`             varchar(50)  NOT NULL,
    `Code`             varchar(15)  NOT NULL,
    `ShortDescription` varchar(500) NOT NULL,
    `Description`      longtext     NOT NULL,
    `Picture`          longtext     NOT NULL,
    `PictureAlt`       varchar(155) NOT NULL,
    `PictureTitle`     varchar(60)  NOT NULL,
    `MetaDescription`  varchar(255) NOT NULL,
    `Keywords`         varchar(255) NOT NULL,
    `Slug`             longtext     NOT NULL,
    `CategoryId`       bigint(20) NOT NULL,
    `CreationDate`     datetime(6) NOT NULL,
    `IsDeleted`        tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Products`
--

INSERT INTO `Products` (`Id`, `Name`, `Code`, `ShortDescription`, `Description`, `Picture`, `PictureAlt`,
                        `PictureTitle`, `MetaDescription`, `Keywords`, `Slug`, `CategoryId`, `CreationDate`,
                        `IsDeleted`)
VALUES (6, 'صندلی چهارپایه مدل ۱۱۱', '۱۱۱', 'صندلی چهارپایه مدل ۱۱۱ مدرن با طراحی مدرن و زیبا ',
        'این صندلی یکی از پرفروش ترین صندلی ها موجود هست و طراحی به شدت زیبا و کیفیت ساخت بسیار بالای دارد',
        'صندلی-چهارپایه-مدل//2026-02-27-00-08-19-Product11.jpg', 'صندلی ۱۱۱', 'صندلی مدل ۱۱۱',
        'صندلی چهارپایه مدل ۱۱۱ مدرن با طراحی مدرن و زیبا ', 'صندلی مدل۱۱۱', 'صندلی-چهارپایه-مدل-111', 5,
        '2026-02-27 00:08:19.159613', 0),
       (7, 'نگهدارنده چوبی مدل ۲۱۱', '۲۱۱', 'نگهدارنده چوبی با طراحی مدرن و کیفیت ساخت بالا',
        'یکی از بهترین و زیباترین نگهدارنده های با سایز بزرگ که میتوان تهیه کرد و پرفروش',
        'نگهدارنده-چوبی-مدل//2026-02-27-00-10-43-Product07.jpg', 'نگهدارنده مدل ۲۱۱', 'نگهدارنده چوبی مدل ۲۱۱',
        'نگهدارنده چوبی با طراحی مدرن و کیفیت ساخت بالا', 'نگهدارنده مدرن مدل ۲۱۱', 'نگهدارنده-چوبی-مدل-211', 6,
        '2026-02-27 00:10:43.376726', 0),
       (8, 'نگهدارنده چوبی مدل ۲۲۳', '۲۲۳', 'نگهدارنده چوبی مدل ۲۲۳',
        'نگهدارنده چوبی مدل ۲۲۳ یکی از گزینه های معقول که با قیمتی به صرفه ارزش خرید بالایی دارد',
        'نگهدارنده-چوبی-مدل//2026-02-27-00-12-19-Product08.jpg', 'نگهدارنده مدل ۲۲۳', 'نگهدارنده چوبی مدل ۲۲۳',
        'نگهدارنده چوبی مدل ۲۲۳', 'نگهدارنده مدرن مدل ۲۲۳', 'نگهدارنده-چوبی-مدل-223', 6, '2026-02-27 00:12:19.688757',
        0),
       (9, 'پاف مدل ۱۲۱', '۱۲۱', 'پاف با طراحی جدید مدل ۱۲۱', 'پافی نرم و مناسب برای خانه های کوچک و اپارتمانی',
        'پاف-مدل۱۲۱//2026-02-27-00-15-06-product01.jpg', 'پاف مدل ۱۲۱', 'پاف مدل ۱۲۱', 'پاف با طراحی جدید مدل ۱۲۱',
        'پاف', 'پاف-مدل۱۲۱', 7, '2026-02-27 00:15:06.092986', 0),
       (10, 'پاف مدل ۱۳۱', '۱۳۱', 'پاف مدل ۱۳۱',
        'پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب ',
        'پاف-مدل//2026-02-27-00-16-21-product02.jpg', 'پاف مدل ۱۳۱', 'پاف مدل ۱۳۱', 'پاف مدل ۱۳۱', 'پاف', 'پاف-مدل', 7,
        '2026-02-27 00:16:21.977162', 0),
       (11, 'پاف مدل ۱۴۲', '۱۴۲', 'پاف مدل ۱۴۲',
        'پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب پافی اقتصادی ومناسب ',
        'پاف-مدل//2026-02-27-00-17-01-product04.jpg', 'پاف مدل ۱۴۲', 'پاف مدل ۱۴۲', 'پاف مدل ۱۴۲', 'پاف', 'پاف-مدل۱۴۲',
        7, '2026-02-27 00:17:01.476978', 0),
       (12, 'نگهدارنده فلزی مدل ۱۴۲', '۱۴۲', 'نگهدارنده فلزی مدل ۱۴۲',
        'نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب نگهدارنده اقتصادی ومناسب ',
        'نگهدارنده-چوبی-مدل//2026-02-27-00-20-10-Product05.jpg', 'نمدل ۱۴۲', 'پاف مدل ۱۴۲', 'نگهدارنده فلزی مدل ۱۴۲',
        'پاف', 'نگهدارنده-چوبی-مدل-142', 6, '2026-02-27 00:20:11.000660', 0),
       (13, 'صندلی چهارپایه مدل ۲۲۱', '۲۲۱', 'صندلی مدل ۲۲۱',
        'صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی ',
        'صندلی-چهارپایه-مدل//2026-02-27-00-22-23-Product09.jpg', 'صندلی مدل ۲۲۱', 'صندلی مدل ۲۲۱', 'صندلی مدل ۲۲۱',
        'صندلی مدرن', 'صندلی-چهارپایه-مدل-221', 5, '2026-02-27 00:22:23.428123', 0),
       (14, 'صندلی چهارپایه مدل ۳۳۲', '۳۳۲', 'صندلی مدل ۳۳۲',
        'صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی صندلی با طراحی مدرن و اقتصادی ',
        'صندلی-چهارپایه-مدل//2026-02-27-00-23-19-Product10.jpg', 'صندلی مدل ۳۳۲', 'صندلی مدل ۳۳۲', 'صندلی مدل ۳۳۲',
        'صندلی مدرن', 'صندلی-چهارپایه-مدل-332', 5, '2026-02-27 00:23:19.575573', 0),
       (15, 'صندلی چهارپایه مدل ۲۲۲', '۲۲۲', 'صندلی مدل ۲۲۲',
        'صندلی بسیار راحت و مناسب افراد سالمند و دچار درد در ناحیه کمر و ... ',
        'صندلی-چهارپایه-مدل//2026-02-27-01-00-34-6-100x133.jpg', 'صندلی مدل ۲۲۲', 'صندلی مدل ۲۲۲', 'صندلی مدل ۲۲۲',
        'صندلی مدرن راحت', 'صندلی-چهارپایه-مدل-222', 5, '2026-02-27 01:00:34.062450', 0),
       (16, 'صندلی مدل تدی', '۱۱۲',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'صندلی-مدل-تدی//2026-08-09-21-20-56-1785842732741.jpeg', 'تدی ۱۱۲', 'صندلی تدی ۱۱۲',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی', 'صندلی-مدل-تدی', 5, '2026-08-09 21:20:56.840228', 0),
       (17, 'صندلی اوپن دیارا', '113',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی-اوپن-دیارا//2026-08-09-21-22-14-1785842709287.jpeg', 'دیارا ۱۱۳', 'اوپن دیارا',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی', 'صندلی-اوپن-دیارا', 5, '2026-08-09 21:22:01.195142', 0),
       (18, 'صندلی اوپن مدل ۱۱۴', '۱۱۴',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی-اوپن-مدل//2026-08-09-21-23-30-1785842749316.jpeg', 'اوپن ۱۱۴', 'صندلی مدل۱۱۴',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی', 'صندلی-اوپن-مدل', 5, '2026-08-09 21:23:30.545021', 0),
       (19, 'صندلی هلیکا مدل لارا', '۱۱۵',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'صندلی-هلیکا-مدل-لارا//2026-08-09-21-25-14-1785842536162.jpeg', 'هلیکا مدل لارا', 'صندلی هلیکا مدلی لارا ۱۱۵',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی', 'صندلی-هلیکا-مدل-لارا', 5, '2026-08-09 21:25:14.203157', 0),
       (20, 'پاف مدلی مینیفر', '۲۱۳',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'پاف-مدلی-مینیفر//2026-08-09-21-26-59-1785843115633.jpeg', 'پاف مدلی مینیفر', 'پاف مدلی مینیفر',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی', 'پاف-مدلی-مینیفر', 7, '2026-08-09 21:26:59.828174', 0),
       (21, 'پاف مدل هیراد', '۲۱۴',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'پاف-مدل-هیراد//2026-08-09-21-27-57-1785843095865.jpeg', 'پاف مدلی هیراد', 'پاف مدلی هیراد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'صندلی', 'پاف-مدل-هیراد', 7, '2026-08-09 21:27:57.957954', 0),
       (22, 'پاف مدل مربع', '۲۱۶',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'پاف-مدل-مربع//2026-08-09-21-29-29-1785843057223.jpeg', 'پاف مدل مربع', 'پاف مدل مربع',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'پاف', 'پاف-مدل-مربع', 7, '2026-08-09 21:29:29.630162', 0),
       (23, 'پاف مدل حنا', '۲۱۷',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'پاف-مدل-حنا//2026-08-09-21-30-18-1785843075636.jpeg', 'پاف مدل حنا', 'پاف مدل حنا',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'حنا', 'پاف-مدل-حنا', 7, '2026-08-09 21:30:18.931636', 0),
       (24, 'پاف مدل وان', '۲۱۸',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'پاف-مدل-وان//2026-08-09-21-32-26-1785843010378.jpeg', 'پاف مدل وان', 'پاف مدل وان',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'وان', 'پاف-مدل-وان', 7, '2026-08-09 21:32:26.494027', 0),
       (25, 'پاف مدل SW4', '219',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'پاف-مدل-sw4//2026-08-09-21-34-03-1785843044133.jpeg', 'پاف مدل SW4', 'پاف مدل SW4',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'SW4', 'پاف-مدل-sw4', 7, '2026-08-09 21:34:03.181499', 0),
       (26, 'صندلی مدل آرام', '۱۱۹',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'صندلی-مدل-آرام//2026-08-09-21-35-08-1785842613903.jpeg', 'صندلی مدل آرام', 'صندلی مدل آرام',
        'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد',
        'آرام', 'صندلی-مدل-آرام', 5, '2026-08-09 21:35:08.535350', 0);

-- --------------------------------------------------------

--
-- Table structure for table `RolePermissions`
--

CREATE TABLE `RolePermissions`
(
    `Id`     bigint(20) NOT NULL,
    `Code`   int(11) NOT NULL,
    `RoleId` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `RolePermissions`
--

INSERT INTO `RolePermissions` (`Id`, `Code`, `RoleId`)
VALUES (879, 5100, 2),
       (880, 5000, 2),
       (881, 5104, 2),
       (882, 5101, 2),
       (883, 5102, 2),
       (884, 5103, 2),
       (896, 2000, 4),
       (897, 2006, 4),
       (898, 2004, 4),
       (899, 2005, 4),
       (900, 2007, 4),
       (913, 3100, 1),
       (914, 3000, 1),
       (915, 3105, 1),
       (916, 3101, 1),
       (917, 3102, 1),
       (918, 3103, 1),
       (919, 3104, 1),
       (920, 3200, 1),
       (921, 3205, 1),
       (922, 3201, 1),
       (923, 3202, 1),
       (924, 3203, 1),
       (925, 3204, 1),
       (926, 1100, 1),
       (927, 1000, 1),
       (928, 1115, 1),
       (929, 1110, 1),
       (930, 1111, 1),
       (931, 1112, 1),
       (932, 1113, 1),
       (933, 1114, 1),
       (934, 1200, 1),
       (935, 1225, 1),
       (936, 1221, 1),
       (937, 1220, 1),
       (938, 1222, 1),
       (939, 1223, 1),
       (940, 1224, 1),
       (941, 1300, 1),
       (942, 1334, 1),
       (943, 1330, 1),
       (944, 1331, 1),
       (945, 1332, 1),
       (946, 1333, 1),
       (947, 1400, 1),
       (948, 1444, 1),
       (949, 1441, 1),
       (950, 1442, 1),
       (951, 1440, 1),
       (952, 1443, 1),
       (953, 7500, 1),
       (954, 7000, 1),
       (955, 7501, 1),
       (956, 7503, 1),
       (957, 7504, 1),
       (958, 7502, 1),
       (959, 2000, 1),
       (960, 2008, 1),
       (961, 2001, 1),
       (962, 2002, 1),
       (963, 2006, 1),
       (964, 2004, 1),
       (965, 2005, 1),
       (966, 2003, 1),
       (967, 2007, 1),
       (968, 5100, 1),
       (969, 5000, 1),
       (970, 5104, 1),
       (971, 5101, 1),
       (972, 5102, 1),
       (973, 5103, 1),
       (974, 5200, 1),
       (975, 5204, 1),
       (976, 5201, 1),
       (977, 5202, 1),
       (978, 5203, 1),
       (979, 4000, 1),
       (980, 4005, 1),
       (981, 4004, 1),
       (982, 4003, 1),
       (983, 4002, 1),
       (984, 6100, 1),
       (985, 6000, 1),
       (986, 6105, 1),
       (987, 6101, 1),
       (988, 6102, 1),
       (989, 6104, 1),
       (990, 6103, 1),
       (991, 6200, 1),
       (992, 6203, 1),
       (993, 6201, 1),
       (994, 6202, 1),
       (1000, 7500, 5),
       (1001, 7000, 5),
       (1002, 7501, 5),
       (1003, 7503, 5),
       (1004, 7504, 5),
       (1005, 7502, 5);

-- --------------------------------------------------------

--
-- Table structure for table `Roles`
--

CREATE TABLE `Roles`
(
    `Id`           bigint(20) NOT NULL,
    `Name`         varchar(100) NOT NULL,
    `Description`  varchar(500) NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Roles`
--

INSERT INTO `Roles` (`Id`, `Name`, `Description`, `CreationDate`, `IsDeleted`)
VALUES (1, 'مدیر سیستم', 'مدیر سیستم با دسترسی کامل به تمام بخش ها', '2026-03-13 12:24:58.000000', 0),
       (2, 'محتواگذار', 'توانایی  اضاقه کردن مقاله بدون دسترسی به بخش های مهم و حیاتی سایت',
        '2026-03-13 13:52:27.493575', 0),
       (3, 'کاربر', 'یوزر عادی سایت بدون هیج دسترسی', '2026-03-13 14:01:22.062263', 0),
       (4, 'انباردار', 'دسترسی مورد نیاز به بخش انبار فقط', '2026-03-13 16:13:19.431602', 0),
       (5, 'مدیر سفارشات', 'بررسی و تایید یا لغو سفارشات', '2026-03-20 02:59:48.744067', 0);

-- --------------------------------------------------------

--
-- Table structure for table `Slides`
--

CREATE TABLE `Slides`
(
    `Id`           bigint(20) NOT NULL,
    `Picture`      varchar(1000) NOT NULL,
    `PictureAlt`   varchar(500)  NOT NULL,
    `PictureTitle` varchar(500)  NOT NULL,
    `Heading`      varchar(255)  NOT NULL,
    `Title`        varchar(255)  NOT NULL,
    `Text`         varchar(255)  NOT NULL,
    `BtnText`      varchar(50)   NOT NULL,
    `Link`         longtext      NOT NULL,
    `CreationDate` datetime(6) NOT NULL,
    `IsDeleted`    tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `Slides`
--

INSERT INTO `Slides` (`Id`, `Picture`, `PictureAlt`, `PictureTitle`, `Heading`, `Title`, `Text`, `BtnText`, `Link`,
                      `CreationDate`, `IsDeleted`)
VALUES (4, 'slides//2026-02-27-00-26-39-2020-08-10-17-23-52-slider2.jpg', 'صندلی و مبل', 'صندلی و مبل', 'تجربه راحتی',
        'صندلی و مبل راحتی', 'خرید', 'خرید', 'https://localhost:7199/ProductCategory/%D8%B5%D9%86%D8%AF%D9%84%DB%8C',
        '2026-02-27 00:26:39.156076', 0),
       (5, 'slides//2026-02-27-00-29-29-slider3.jpg', 'وسایل تزئینی', 'وسایل تزئینی', 'تجربه زیبایی',
        'زیبایی را به خانه تان بیاورید ', 'خرید', 'خرید',
        'https://localhost:7199/ProductCategory/%D9%86%DA%AF%D9%87%D8%AF%D8%A7%D8%B1%D9%86%D8%AF%D9%87',
        '2026-02-27 00:29:29.248433', 0);

-- --------------------------------------------------------

--
-- Table structure for table `EfMigrationsHistory`
--

CREATE TABLE `EfMigrationsHistory`
(
    `MigrationId`    varchar(150) NOT NULL,
    `ProductVersion` varchar(32)  NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `EfMigrationsHistory`
--

INSERT INTO `EfMigrationsHistory` (`MigrationId`, `ProductVersion`)
VALUES ('20260221164033_initDataBase', '8.0.24'),
       ('20260221174443_correctThePictureStringSize', '8.0.24'),
       ('20260222173735_initProductModel', '8.0.24'),
       ('20260222174118_initProductAndProductPictrueModel', '8.0.24'),
       ('20260222174912_initprodcutAndProductPicturesCorrectly', '8.0.24'),
       ('20260222175121_init', '8.0.24'),
       ('20260223175306_RemoveIsRemovedProperty', '8.0.24'),
       ('20260224075542_addSlideClasses', '8.0.24'),
       ('20260224190556_initDiscountDataBase', '8.0.24'),
       ('20260225100959_initColleagueDiscountDataBase', '8.0.24'),
       ('20260225191643_initInventoryDataBase', '8.0.24'),
       ('20260225192209_initInventoryDabAses', '8.0.24'),
       ('20260225192615_initDiscountDataBases', '8.0.24'),
       ('20260311091803_initBlogDataBases', '8.0.24'),
       ('20260311142858_initCommentDataBases', '8.0.24'),
       ('20260311180455_makeWebsitePropertyNullable', '8.0.24'),
       ('20260312095642_initRoleAndAccountDataBases', '8.0.24'),
       ('20260313083956_InitialAccountAndRoleDataBases', '8.0.24'),
       ('20260315101555_initCartAndOrderDataBases', '8.0.24'),
       ('20260316094242_AddPaymentMethod', '8.0.24'),
       ('20260317144717_AddRatingColumn', '8.0.24'),
       ('20260317213156_addProductSlugToCart', '8.0.24');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `AccountPermissions`
--
ALTER TABLE `AccountPermissions`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_AccountPermissions_AccountId` (`AccountId`);

--
-- Indexes for table `Accounts`
--
ALTER TABLE `Accounts`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_Accounts_RoleId` (`RoleId`);

--
-- Indexes for table `ArticleCategories`
--
ALTER TABLE `ArticleCategories`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `Articles`
--
ALTER TABLE `Articles`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_Articles_CategoryId` (`CategoryId`);

--
-- Indexes for table `CartItems`
--
ALTER TABLE `CartItems`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_CartItems_CartId` (`CartId`);

--
-- Indexes for table `Carts`
--
ALTER TABLE `Carts`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `ColleagueDiscounts`
--
ALTER TABLE `ColleagueDiscounts`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `Comments`
--
ALTER TABLE `Comments`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_Comments_parentId` (`parentId`);

--
-- Indexes for table `CustomerDiscount`
--
ALTER TABLE `CustomerDiscount`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `Inventories`
--
ALTER TABLE `Inventories`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `InventoryOperations`
--
ALTER TABLE `InventoryOperations`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_InventoryOperations_InventoryId` (`InventoryId`);

--
-- Indexes for table `OrderItems`
--
ALTER TABLE `OrderItems`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_OrderItems_OrderId` (`OrderId`);

--
-- Indexes for table `Orders`
--
ALTER TABLE `Orders`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `ProductCategories`
--
ALTER TABLE `ProductCategories`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `ProductPictures`
--
ALTER TABLE `ProductPictures`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_ProductPictures_ProductId` (`ProductId`);

--
-- Indexes for table `Products`
--
ALTER TABLE `Products`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_Products_CategoryId` (`CategoryId`);

--
-- Indexes for table `RolePermissions`
--
ALTER TABLE `RolePermissions`
    ADD PRIMARY KEY (`Id`),
  ADD KEY `IX_RolePermissions_RoleId` (`RoleId`);

--
-- Indexes for table `Roles`
--
ALTER TABLE `Roles`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `Slides`
--
ALTER TABLE `Slides`
    ADD PRIMARY KEY (`Id`);

--
-- Indexes for table `EfMigrationsHistory`
--
ALTER TABLE `EfMigrationsHistory`
    ADD PRIMARY KEY (`MigrationId`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `AccountPermissions`
--
ALTER TABLE `AccountPermissions`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `Accounts`
--
ALTER TABLE `Accounts`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `ArticleCategories`
--
ALTER TABLE `ArticleCategories`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `Articles`
--
ALTER TABLE `Articles`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `CartItems`
--
ALTER TABLE `CartItems`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=199;

--
-- AUTO_INCREMENT for table `Carts`
--
ALTER TABLE `Carts`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `ColleagueDiscounts`
--
ALTER TABLE `ColleagueDiscounts`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `Comments`
--
ALTER TABLE `Comments`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `CustomerDiscount`
--
ALTER TABLE `CustomerDiscount`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `Inventories`
--
ALTER TABLE `Inventories`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `InventoryOperations`
--
ALTER TABLE `InventoryOperations`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=206;

--
-- AUTO_INCREMENT for table `OrderItems`
--
ALTER TABLE `OrderItems`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=111;

--
-- AUTO_INCREMENT for table `Orders`
--
ALTER TABLE `Orders`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- AUTO_INCREMENT for table `ProductCategories`
--
ALTER TABLE `ProductCategories`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `ProductPictures`
--
ALTER TABLE `ProductPictures`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `Products`
--
ALTER TABLE `Products`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `RolePermissions`
--
ALTER TABLE `RolePermissions`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1006;

--
-- AUTO_INCREMENT for table `Roles`
--
ALTER TABLE `Roles`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `Slides`
--
ALTER TABLE `Slides`
    MODIFY `Id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `AccountPermissions`
--
ALTER TABLE `AccountPermissions`
    ADD CONSTRAINT `FK_AccountPermissions_Accounts_AccountId` FOREIGN KEY (`AccountId`) REFERENCES `Accounts` (`Id`);

--
-- Constraints for table `Accounts`
--
ALTER TABLE `Accounts`
    ADD CONSTRAINT `FK_Accounts_Roles_RoleId` FOREIGN KEY (`RoleId`) REFERENCES `Roles` (`Id`);

--
-- Constraints for table `Articles`
--
ALTER TABLE `Articles`
    ADD CONSTRAINT `FK_Articles_ArticleCategories_CategoryId` FOREIGN KEY (`CategoryId`) REFERENCES `ArticleCategories` (`Id`);

--
-- Constraints for table `CartItems`
--
ALTER TABLE `CartItems`
    ADD CONSTRAINT `FK_CartItems_Carts_CartId` FOREIGN KEY (`CartId`) REFERENCES `Carts` (`Id`);

--
-- Constraints for table `Comments`
--
ALTER TABLE `Comments`
    ADD CONSTRAINT `FK_Comments_Comments_parentId` FOREIGN KEY (`parentId`) REFERENCES `Comments` (`Id`);

--
-- Constraints for table `InventoryOperations`
--
ALTER TABLE `InventoryOperations`
    ADD CONSTRAINT `FK_InventoryOperations_Inventories_InventoryId` FOREIGN KEY (`InventoryId`) REFERENCES `Inventories` (`Id`);

--
-- Constraints for table `OrderItems`
--
ALTER TABLE `OrderItems`
    ADD CONSTRAINT `FK_OrderItems_Orders_OrderId` FOREIGN KEY (`OrderId`) REFERENCES `Orders` (`Id`);

--
-- Constraints for table `ProductPictures`
--
ALTER TABLE `ProductPictures`
    ADD CONSTRAINT `FK_ProductPictures_Products_ProductId` FOREIGN KEY (`ProductId`) REFERENCES `Products` (`Id`);

--
-- Constraints for table `Products`
--
ALTER TABLE `Products`
    ADD CONSTRAINT `FK_Products_ProductCategories_CategoryId` FOREIGN KEY (`CategoryId`) REFERENCES `ProductCategories` (`Id`);

--
-- Constraints for table `RolePermissions`
--
ALTER TABLE `RolePermissions`
    ADD CONSTRAINT `FK_RolePermissions_Roles_RoleId` FOREIGN KEY (`RoleId`) REFERENCES `Roles` (`Id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
